# -*- org-export-babel-evaluate: (quote inline-only);  -*-
#+TITLE: Variant Calling with R/Bioconductor
#+AUTHOR: Michael Lawrence

#+OPTIONS: toc:t H:2

#+startup: beamer
#+LaTeX_CLASS: beamer

#+PROPERTY: exports both
#+PROPERTY: results output
#+PROPERTY: eval no-export
#+PROPERTY: session *R*
#+PROPERTY: tangle yes

#+BEGIN_LaTeX
\AtBeginSubsection[]
{
  \begin{frame}<beamer>{Outline}
    \tableofcontents[currentsection,currentsubsection]
  \end{frame}
}
\AtBeginSection[]
{
  \begin{frame}<beamer>{Outline}
    \tableofcontents[currentsection]
  \end{frame}
}
#+END_LaTeX

** Self-chain score as soft filter
   We can formally flag variants by self-chain overlap without
   discarding them from the dataset:
   #+begin_src R
     unchained.filter <-
       FilterRules(list(unchained = function(x) {
         x %outside% selfChains
       }))
     variants <- softFilter(variants, unchained.filter)
     summary(softFilterMatrix(variants))
   #+end_src

   #+RESULTS:
   : <initial> unchained   <final> 
   :    229272    213733    213733
   
** Previewing a VCF file
   * For reading a VCF, we rely on the *VariantAnnotation* package.
   * Always start by checking the header of an unfamiliar VCF file, so
     that we can:
     * Check the integrity of the data and 
     * Determine which parts need to be imported
   #+begin_src R
     vcf.file <- NA12878_pg.chr20.vcf.bgz
     header <- scanVcfHeader(vcf.file)
     header
   #+end_src

   #+RESULTS:
   : class: VCFHeader 
   : samples(1): NA12878
   : meta(7): fileformat ApplyRecalibration ... source fileDate
   : fixed(1): FILTER
   : info(22): AC AF ... culprit set
   : geno(8): GT GQX ... PL VF

** Inspecting the VCF header
   The most important information is usually the sample-specific
   values, which typically include the genotype, as in this case:
   #+begin_src R
   geno(header)
   #+end_src

   #+RESULTS:
   #+begin_example
   DataFrame with 8 rows and 3 columns
            Number        Type    Description                                                                  
       <character> <character>    <character>                                                                  
   GT            1      String    GT  Genotype                                                                 
   GQX           1     Integer    GQX Min genotype quality...
   AD            .     Integer    AD  Allelic depths
   DP            1     Integer    DP  Approximate read depth
   GQ            1       Float    GQ  Genotype Quality
   MQ            1     Integer    MQ  RMS Mapping Quality
   PL            G     Integer    PL  Likelihoods for each alt
   VF            1       Float    VF  Variant frequency
#+end_example

** Detecting gVCF
   We also notice something interesting in the =INFO= header:
   #+begin_src R
   info(header)["END",]
   #+end_src

   #+RESULTS:
   : DataFrame with 1 row and 3 columns
   :          Number        Type                   Description
   :     <character> <character>                   <character>
   : END           1     Integer End position of the region...

   The presence of the =END= =INFO= field indicates that we are
   actually dealing with a special type of VCF called a gVCF, where
   "g" stands for "genomic"; more later.

** Full VCF import
   * We now load the VCF data into R using =readVcf()=:
     #+begin_src R :results silent
     vcf <- readVcf(vcf.file, genome="hg19")
     #+end_src
   * We pass a genome identifier to track provenance and ensure data integrity.
   * Loading the full file consumes a lot of memory, much of which may
     be wasted if we are only interested in one region, or some subset
     of the fields
   * This is the size for chr20:
     #+begin_src R
     print(object.size(vcf), unit="auto")
     #+end_src

     #+RESULTS:
     : 300 Mb

   * But for the genome, this would be closer to 12 GB,  which is
     beyond the memory capacity of most laptops
  
** /VCF/ objects
  The =readVcf()= function returns a /VCF/ object, a derivative of
  /SummarizedExperiment/ that fully and formally represents the
  complexity of the VCF file.
  * =rowData(vcf)= :: /GRanges/ object holding the positions and
                      fixed, position-level columns
      #+begin_src R
      colnames(mcols(rowData(vcf)))
      #+end_src

      #+RESULTS:
      : [1] "paramRangeID" "REF" "ALT" "QUAL" "FILTER"

  * =info(vcf)= :: /DataFrame/ of position- and alt-level fields
      #+begin_src R
      head(colnames(info(vcf)))
      #+end_src

      #+RESULTS:
      : [1] "AC" "AF" "AN"               
      : [4] "DP" "QD" "BLOCKAVG_min30p3a"

  * =geno(vcf)= :: Sample-specific values, including the 
    genotype
      #+begin_src R
      names(geno(vcf))
      #+end_src

      #+RESULTS:
      : [1] "GT" "GQX" "AD" "DP" "GQ" "MQ" "PL" "VF"

** Selection by variant type
  Of the fixed columns, the most important is the =ALT= column, which
  stores the alternate allele(s) for each record.
  #+begin_src R
  head(alt(illumina_variants))
  #+end_src

  #+RESULTS:
  #+begin_example
  DNAStringSetList of length 150402
  [[1]] T
  [[2]] CT
  [[3]] C
  [[4]] C
  [[5]] T
  [[6]] C
  ...
  <150392 more elements>
#+end_example
  
  Restrict to SNVs using the =isSNV= helper:
  #+begin_src R
    selectSNVs <- isSNV(illumina_variants)
    illumina_snvs <- subset(illumina_variants, selectSNVs)
  #+end_src

** Expanding the /VCF/: one alt per record
  /VCF/ supports multiple alts per row:
  #+begin_src R
  class(alt(illumina_snvs))
  #+end_src

  #+RESULTS:
  : [1] "DNAStringSetList"
  : attr(,"package")
  : [1] "Biostrings"

  But it is easier to reason on data with one alt per row, which we
  can achieve with =expand=:
  #+begin_src R
  illumina_snvs <- expand(illumina_snvs)
  class(alt(illumina_snvs))
  #+end_src

  #+RESULTS:
  : [1] "DNAStringSet"
  : attr(,"package")
  : [1] "Biostrings"
  
** Filtering a VCF file: =filterVcf=
   * After filtering, the /VCF/ object is much smaller
     #+begin_src R
     print(object.size(illumina_snvs), unit="auto")
     #+end_src

     #+RESULTS:
     : 37.2 Mb

   * The reduction is sufficient for us to operate on the calls from
     the entire genome, not just chr20.
   * In general, we want to apply the filter to the entire file,
     without loading all of the data into memory.
   * The =filterVcf= function steams over a VCF file, writing out the
     records that pass two types of filters:
     * =prefilters= :: Applied to the raw text of this file (faster
                       but riskier), and
     * =filters= :: Applied to the data parsed as a /VCF/ file.

** Accessing included QC filters
   * The =filt()= component marks which QC filters failed a variant
   * Variants that pass all QC filters are labeled "PASS"
   * Here, we list the descriptions of the filter codes from the header:
   #+begin_src R
   fixed(header(illumina_snvs))$FILTER
   #+end_src

   #+RESULTS:
   #+begin_example
   DataFrame with 9 rows and 1 column
   Description
   <character>
   LowGQX               Locus GQX < 30.0000 or not present
   LowQD                Locus QD < than 2.0000
   LowMQ                Site MQ < than 20.0000
   IndelConflict        Region has conflicting indel calls
   MaxDepth             Site depth > 3.0x the mean depth
   SiteConflict         Genotype conflicts with proximal indel
   ...                  ...
#+end_example

** Summarizing the QC filters
   #+begin_src R
     table(unlist(strsplit(filt(illumina_snvs), ";")))
   #+end_src

   #+RESULTS:
   #+begin_example
   IndelConflict    LowGQX 
              35     11020 
           LowMQ     LowQD 
            1055     19583 
        MaxDepth      PASS 
              25     68626 
    SiteConflict       ...
             785       ...
#+end_example

** Restricting by the QC filters
   For the purposes of this tutorial, we will restrict to
   the "PASS" variants:
   #+begin_src R :results silent
     passed <- grep("PASS", filt(illumina_snvs), fixed=TRUE)
     illumina_snvs <- illumina_snvs[passed,]
   #+end_src

   After that filter, there are very few positions with outlying
   coverage values:
   #+begin_src R
     rowData(illumina_snvs)$coverage.bin <-
       cut(geno(illumina_snvs)$DP, c(0, 20, 80, Inf))
     table(rowData(illumina_snvs)$coverage.bin)
   #+end_src

   #+RESULTS:
   :   (0,20]  (20,80] (80,Inf] 
   :       63    68528       35
   
*** Sensitivity
   #+begin_src R
     illumina_vr$in.vt <- illumina_vr %in% snvs
     mean(illumina_vr$in.vt)  
   #+end_src
   #+RESULTS:
   : [1] 0.9654358

*** Specificity
   #+begin_src R
     snvs$in.illumina <- snvs %in% illumina_vr
     mean(snvs$in.illumina)
   #+end_src

   #+RESULTS:
   : [1] 0.3085657

** False negatives: which filter to blame?
   Apply the calling filters to our FN and summarize the results:
   #+begin_src R :results value replace :colnames yes
     calling.filters <- hardFilters(snvs)[3:5]
     tallies <- resetFilter(tallies)
     tallies <- softFilter(tallies, calling.filters,
                           serial=TRUE)
     fn <- tallies[tallies %in% subset(illumina_vr, !in.vt)]
     t(summary(softFilterMatrix(fn)))
   #+end_src

   #+RESULTS:
   | <initial> | readCount | likelihoodRatio | avgNborCount | <final> |
   |-----------+-----------+-----------------+--------------+---------|
   |      1052 |      1036 |            1035 |            0 |       0 |

** Genomic context
   =locateVariants()= annotates variants with overlapping genes.
   #+begin_src R :results silent
     gene.models <- TxDb.Hsapiens.UCSC.hg19.knownGene
     snvs <- keepSeqlevels(snvs, "20")
     seqlevelsStyle(snvs) <- "UCSC"
     genome(snvs) <- "hg19"
     locations <- locateVariants(snvs, gene.models,
                                 CodingVariants())
   #+end_src

   The return value, =locations=, is a /GRanges/ with these columns:
   #+begin_src R
   colnames(mcols(locations))
   #+end_src

   #+RESULTS:
   : [1] "LOCATION"  "QUERYID"   "TXID"      "CDSID"
   : [5] "GENEID"    "PRECEDEID" "FOLLOWID"

** Coding consequences
   =predictCoding()= predicts coding consequences:
   #+begin_src R :results silent
     coding <- predictCoding(snvs, gene.models, Hsapiens,
                             varAllele = DNAStringSet(alt(snvs)))
   #+end_src

   The returned object, =coding=, is a /VRanges/ object with a number
   of additional metadata columns:
   #+begin_src R
   setdiff(colnames(mcols(coding)), colnames(mcols(snvs)))
   #+end_src

   #+RESULTS:
   :  [1] "varAllele"   "CDSLOC"      "PROTEINLOC"  "QUERYID"     "TXID"       
   :  [6] "CDSID"       "GENEID"      "CONSEQUENCE" "REFCODON"    "VARCODON"   
   : [11] "REFAA"       "VARAA"

** Summarizing the consequences
   We tabulate the consequence codes:
   #+begin_src R
   table(coding$CONSEQUENCE)
   #+end_src

   #+RESULTS:
#+begin_example
     nonsense nonsynonymous    synonymous 
           66          3651          1259
#+end_example

